tutorials/single_phase_elastic/pillars/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
	    smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

   "(U|Us)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
	    maxIter         1000;
    }

    "(U|Us)Final"
    {
        $U;
        relTol          0;
    }

    epss
    {
        solver          smoothSolver;
	    smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }    

    epssFinal
    {
        $epss;
        relTol          0;
    }

    "(D|T)"
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.9;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }

}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    2;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    pRefCell    0;
    pRefValue    0;
}

relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}

stressAnalysis
{
    compactNormalStress yes;
    nCorrectors     5;
    D               1e-06;
}

// ************************************************************************* //
